In [73]:
import os
os.getcwd()

'C:\\Users\\Divya Shinde'

In [74]:
import pandas as pd
orders = pd.read_csv("orders.csv")
orders.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [75]:
users = pd.read_json("users.json")
users.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [76]:
import sqlite3
conn = sqlite3.connect(':memory:')
with open('restaurants.sql', 'r') as f:
    conn.executescript(f.read())
restaurants = pd.read_sql_query("SELECT * FROM restaurants", conn)
conn.close()
restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [77]:
merged1 = orders.merge(users, on='user_id', how='left')
merged1.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular

In [78]:
final_data = merged1.merge(restaurants, on='restaurant_id', how='left')
final_data.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [79]:
final_data.to_csv("final_merged.csv", index=False)
print("File saved!")

File saved!

In [80]:
import os
print("Current folder files:")
print(os.listdir('.'))
final_data.head()  # Direct memory se

Current folder files:
['.anaconda', '.arduinoIDE', '.conda', '.condarc', '.continuum', '.convex', '.docker', '.gitconfig', '.idlerc', '.ipynb_checkpoints', '.ipython', '.junie', '.jupyter', '.keras', '.labelImgSettings.pkl', '.lesshst', '.matplotlib', '.ms-ad', '.ollama', '.streamlit', '.virtual_documents', '.vscode', 'AI-virtual-mouse', 'anaconda3', 'ansel', 'AppData', 'Application Data', 'Attachments', 'check_python.py', 'Contacts', 'Cookies', 'divyashinde av', 'Documents', 'Downloads', 'Favorites', 'final_food_delivery_dataset.csv', 'final_merged.csv', 'food_delivery_hackathon', 'haarcascade_frontalface_default.xml', 'hello.c', 'hello.cpp', 'hello.exe', 'java', 'java_error_in_webstorm_23360.log', 'labelImg', 'Links', 'Local Settings', 'Microsoft', 'Music', 'My Documents', 'myenv', 'NetHood', 'NTUSER.DAT', 'ntuser.dat.LOG1', 'ntuser.dat.LOG2', 'NTUSER.DAT{574964f9-308a-11f0-af8d-d9e9ae0c0b43}.TxR.0.regtrans-ms', 'NTUSER.DAT{574964f9-308a-11f0-af8d-d9e9ae0c0b43}.TxR.1.regtrans-ms', 'NTUSER.DAT{574964f9-308a-11f0-af8d-d9e9ae0c0b43}.TxR.2.regtrans-ms', 'NTUSER.DAT{574964f9-308a-11f0-af8d-d9e9ae0c0b43}.TxR.blf', 'NTUSER.DAT{574964fa-308a-11f0-af8d-d9e9ae0c0b43}.TM.blf', 'NTUSER.DAT{574964fa-308a-11f0-af8d-d9e9ae0c0b43}.TMContainer00000000000000000001.regtrans-ms', 'NTUSER.DAT{574964fa-308a-11f0-af8d-d9e9ae0c0b43}.TMContainer00000000000000000002.regtrans-ms', 'ntuser.ini', 'OneDrive', 'orders.csv', 'plantvillage dataset.zip', 'potato-disease-classification.ipynb', 'PrintHood', 'Recent', 'restaurants.db', 'restaurants.sql', 'Saved Games', 'Searches', 'SendTo', 'Start Menu', 'Templates', 'Untitled-1C.c', 'Untitled.ipynb', 'Untitled1.ipynb', 'Untitled2.ipynb', 'Untitled3.ipynb', 'Untitled4.ipynb', 'Untitled5.ipynb', 'Untitled6.ipynb', 'Untitled7.ipynb', 'Untitled8.ipynb', 'Untitled9.ipynb', 'users.json', 'Videos', 'WebstormProjects', 'WonderCast', 'WPS Cloud Files']

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [81]:
#Q1:
gold = final_data[final_data.membership=='Gold']
cities = gold.groupby('city').total_amount.sum()
print(cities.max(), cities.idxmax())

1080909.79 Chennai

In [82]:
#Q2:
g = final_data[final_data.membership=='Gold'].groupby('city').total_amount.sum()
print(g)
print("Winner:", g.idxmax())

city
Bangalore     994702.59
Chennai      1080909.79
Hyderabad     896740.19
Pune         1003012.32
Name: total_amount, dtype: float64
Winner: Chennai

In [83]:
#Q3:
c = final_data.groupby('cuisine').total_amount.mean()
print(c)
print("Winner:", c.idxmax())

cuisine
Chinese    798.389020
Indian     798.466011
Italian    799.448578
Mexican    808.021344
Name: total_amount, dtype: float64
Winner: Mexican

In [84]:
# lets confirm the output 
print("Mexican average:", cuisine_avg['Mexican'])
print("Chinese average:", cuisine_avg['Chinese'])
print("Italian average:", cuisine_avg['Italian'])
print("Indian average:", cuisine_avg['Indian'])

Mexican average: 808.0213444401395
Chinese average: 798.3890198511166
Italian average: 799.4485781990521
Indian average: 798.4660105305792

In [85]:
#Q4:
u = final_data.groupby('user_id').total_amount.sum()
c = len(u[u>1000])
print(c, "users > ₹1000")
print("Answer:", "< 500" if c<500 else "500–1000" if c<=1000 else "1000–2000" if c<=2000 else "> 2000")

2544 users > ₹1000
Answer: > 2000

In [86]:
final_data['range'] = final_data.rating.apply(lambda x: '3-3.5' if 3<=x<=3.5 else '3.6-4' if 3.6<=x<=4 else '4.1-4.5' if 4.1<=x<=4.5 else '4.6-5')
r = final_data.groupby('range').total_amount.sum()
print(r)
print("Winner:", r.idxmax())

range
3-3.5      2136772.70
3.6-4      1717494.41
4.1-4.5    1960326.26
4.6-5      2197030.75
Name: total_amount, dtype: float64
Winner: 4.6-5

In [87]:
#Q5:
g = final_data[final_data.membership=='Gold'].groupby('city').total_amount.mean()
print(g)
print("Winner:", g.idxmax())

city
Bangalore    793.223756
Chennai      808.459080
Hyderabad    806.421034
Pune         781.162243
Name: total_amount, dtype: float64
Winner: Chennai

In [88]:
#Q6:
c = final_data.groupby('cuisine').agg({'restaurant_id':'nunique','total_amount':'sum'}).sort_values('restaurant_id')
print(c)
print("ANSWER:", c.index[0])

         restaurant_id  total_amount
cuisine
Chinese            120    1930504.65
Indian             126    1971412.58
Italian            126    2024203.80
Mexican            128    2085503.09
ANSWER: Chinese

In [89]:
#Q7:
gold_pct = round((len(final_data[final_data.membership=='Gold']) / len(final_data)) * 100)
print(f"{gold_pct}%")

50%

In [90]:
for r in ['Grand Cafe Punjabi','Grand Restaurant South Indian','Ruchi Mess Multicuisine','Ruchi Foods Chinese']:
    o = final_data[final_data.restaurant_name_x==r]
    if len(o)<20: print(r, len(o), "orders, avg", round(o.total_amount.mean()))

Ruchi Foods Chinese 19 orders, avg 687

In [91]:
#Q9:
for m,c in [('Gold','Indian'),('Gold','Italian'),('Regular','Indian'),('Regular','Chinese')]:
    print(f"{m}+{c}: ₹{final_data[(final_data.membership==m)&(final_data.cuisine==c)].total_amount.sum():,.0f}")

Gold+Indian: ₹979,312
Gold+Italian: ₹1,005,779
Regular+Indian: ₹992,100
Regular+Chinese: ₹952,791

In [95]:
#q10:
final_data['date'] = pd.to_datetime(final_data.order_date, dayfirst=True)
final_data['qtr'] = final_data.date.dt.month.map({1:1,2:1,3:1,4:2,5:2,6:2,7:3,8:3,9:3,10:4,11:4,12:4})

# Step 2: Revenue calculate (ab run karo)
q = [final_data[final_data.qtr==i].total_amount.sum() for i in [1,2,3,4]]
print(f"Q1: ₹{q[0]:,.0f}, Q2: ₹{q[1]:,.0f}, Q3: ₹{q[2]:,.0f}, Q4: ₹{q[3]:,.0f}")
print("Highest:", "Q1"if q[0]==max(q) else "Q2"if q[1]==max(q) else "Q3"if q[2]==max(q) else "Q4")

Q1: ₹2,010,627, Q2: ₹1,945,349, Q3: ₹2,037,385, Q4: ₹2,018,264
Highest: Q3

In [98]:
print("Gold members total orders:", len(final_data[final_data.membership == 'Gold']))

Gold members total orders: 4987

In [99]:
print("Hyderabad revenue:", round(final_data[final_data.city == 'Hyderabad']['total_amount'].sum()))

Hyderabad revenue: 1889367

In [100]:
print("Distinct users with orders:", final_data['user_id'].nunique())

Distinct users with orders: 2883

In [102]:
print("Gold AOV:", round(final_data[final_data.membership == 'Gold']['total_amount'].mean(), 2))

Gold AOV: 797.15

In [103]:
print("Orders with rating ≥ 4.5:", len(final_data[final_data.rating >= 4.5]))

Orders with rating ≥ 4.5: 3374

In [105]:
#we know top revenue city for gold memebers is chennai so
print("Gold orders in top city:", len(final_data[(final_data.membership == 'Gold') & (final_data.city == 'Hyderabad')]))

Gold orders in top city: 1112

In [107]:
print("Total rows:", len(final_data))

Total rows: 10000

In [108]:
# Ye run karo - membership NaN > 0 = users.json se!
print("membership NaN count:", final_data['membership'].isna().sum())

membership NaN count: 0